In [30]:
import pandas as pd 
technologies={
    'courses':['python','DBMs','Java','python','AL/ML'],
    'Fee':[20000,25000,26000,22000,24000],
    'Duration':['30days','40days','35days','60days','30days'],
    'Discount':[1000,2300,1200,2500,2000]
    }
df=pd.DataFrame(technologies)
print(df)

  courses    Fee Duration  Discount
0  python  20000   30days      1000
1    DBMs  25000   40days      2300
2    Java  26000   35days      1200
3  python  22000   60days      2500
4   AL/ML  24000   30days      2000

Using group by functions in dataframe to find first and last element in a group

In [31]:
df.groupby('courses').agg({'Duration':'count','Fee':['first','last']})

        Duration    Fee
           count  first   last
courses
AL/ML          1  24000  24000
DBMs           1  25000  25000
Java           1  26000  26000
python         2  20000  22000

using groupby function to dataframe to get count

In [32]:
df.groupby('courses').agg({'Fee':'count'})

         Fee
courses
AL/ML      1
DBMs       1
Java       1
python     2